// ! == ===
// ! < > <= >=
// ! && and
// ! || or

// if(23 > 10) {

//     console.log('true number');

// } else {

//     console.log('false number');

// }

// let num = 10

// if(num === 10 || 'red' == 'red') {
//     console.log('true number');
// } else {
//     console.log('false number');
    
// }


// if(30 <= 30 && 'blue' === 'red' || 100 === 100) {
//     console.log('true number');
    
// }


// ! შექმენით ხილის და ფერების მასივები, თითოში 3-4 ელემენტი
// ! 1. იპოვეთ არსებობს თუ არა ამ ხილში კონკრ. ხილის ელემენტი, მაგ: ვაშლი
// ! 2. თუ არსებობს ვაშლი და ეს არის ყვითელი ან წითელი, კალათში არის წითელი ან ყვითელი ვაშლი, ან არ არის ვაშლი;
// ! 3. თუ არსებობს კონკრ ხილი, გადაიყვანეთ სტრინგად. 
// ! 4. თუ მასივში არ არსებობს კონკრ. ხილი, დაამატეთ ბოლო ელემენტად. 
// ! 5. შექმენით უსერების 2 ან 3 ობიექტი: შეამოწმეთ ვინ არის მაგ: სრულწლოვანი და მხოლოდ ის წავიდეს კლუბში :)


let basket = [
    {
        fruits: ['apple', 'banana', 'pineaple'],
        colors : ['red', 'green', 'yellow']
    }
]


if (basket[0].fruits[1]) {
    console.log('კალათაში არის ეს ხილი', basket[0].fruits);
} else {
    console.log('კალათაში ეს ხილი არ არის');
    
    basket.push('orange'); 
    
    console.log('განახლებული კალათა:', basket); 
}