// ! For Loop

// ! for აქვს სამი ბრძანება: 
// * 1) ინიციალიზაცია, საიდან დაიწყოს მოქმედება
// * 2) პირობა
// * 3) ინკრემენტი / დეკრემენტი
// ! ++ გაზრდა ერთით
// ! -- კლება ერთით


// let num = 20
// console.log(num);
// g

// for(let i = 0; i <= num; i+=2) {
//     console.log(i);
    
// }

// for(let i = 50; i >= 20; i-=5) {

//     console.log(i, '50-დან 20-მდე');
    
// }

// for(let i = 10; i <= 30; i+=3) {

//     console.log(i, '10-დან 30-მდე');
    
// }

// const cars = ['BMW', 'TESLA', 'LEXUS']

// for(let i = 0; i < cars.length; i++) {

//     console.log(i, cars[i]);
    
// }

// ! მასივში ობიექტები - 18< > კლუბში არ ვუშვებთ

const students = [
    {
        name: 'Giorgi',
        age: 23
    },
    {
        name: 'Nini',
        age: 23
    },
    {
        name: 'Saba',
        age: 15
    }
]

for(let i = 0; i < students.length; i++) {

    let age_line = students[i].age >= 18 ? 'შეუძლია შესვლა' : 'ვერ შევა'
    console.log(`${students[i].name} არის ${students[i].age} წლის: ${age_line}`);
    
}


// ! სტუდენტი ანა - [ 45, 90, 18] -საშუალო - მათემატიკაში
// ! თუ სტუდენტის საშუალო 51-ზე ნაკლებია, ვერ ჩააბარა გამოცდა ;
// ! დათვალეთ რამდენმა სტუდენტმა ვერ ჩააბარა ან ჩააბარა გამოცდა;
// ! იპოვეთ რამდენმა მიიღო 85-ზე მაღალი ქულა. 
// ! 

// ! იპოვეთ 100-დან უმაღლესი რიცხვი  და უმდაბლესი. 
// ! იპოვეთ ყველა ლუწი რიცხვი მასივში და დააჯამეთ. 
// ! გამოიყენეთ min და max საჭიროების შემთხვევაში. 


// ! თუ რიცხვები მეორდება, მხოლოდ ერთხელ შემოიტანეთ, თუ არ მეორდება ცალკე დააჯამათ
// ! იპოვეთ ორი მასივის საერთო ელემენტები;
// ! თუ ორივე მასივში მეორდება ელემენტები, შემოიტანეთ მხოლოდ რაც არ მეორდება;




                
